backend/app/controllers/api/v1/players_controller.rb

      def index
        render json: Player.all
---
SELECT "players".* FROM "players"

      def create
        @player = Player.new(player_params)
        if @player.save
---
INSERT INTO "players" ("name") VALUES ($1) RETURNING "id"  [["name", "charlie"]]

      def login
        player_name = params[:name]
        player = Player.find_by(name: player_name)
---
SELECT  "players".* FROM "players" WHERE "players"."name" = $1 LIMIT $2  [["name", "fsfasfasfa"], ["LIMIT", 1]]