backend/app/controllers/api/v1/scores_controller.rb

      def index
        render json: Score.all
---
SELECT "scores".* FROM "scores"